## imports

In [2]:
import pandas as pd
import numpy as np
from dateutil import parser
import os

## load data

In [10]:
df = pd.read_csv('../raw_data/ds_salaries.csv')
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [11]:
df.describe(include='all')

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
count,607.000000,607.000000,607,607,607,6.070000e+02,607,607.000000,607,607.00000,607,607
unique,NaN,NaN,4,4,50,NaN,17,NaN,57,NaN,50,3
top,NaN,NaN,SE,FT,Data Scientist,NaN,USD,NaN,US,NaN,US,M
freq,NaN,NaN,280,588,143,NaN,398,NaN,332,NaN,355,326
mean,303.000000,2021.405272,NaN,NaN,NaN,3.240001e+05,NaN,112297.869852,NaN,70.92257,NaN,NaN
std,175.370085,0.692133,NaN,NaN,NaN,1.544357e+06,NaN,70957.259411,NaN,40.70913,NaN,NaN
min,0.000000,2020.000000,NaN,NaN,NaN,4.000000e+03,NaN,2859.000000,NaN,0.00000,NaN,NaN
25%,151.500000,2021.000000,NaN,NaN,NaN,7.000000e+04,NaN,62726.000000,NaN,50.00000,NaN,NaN
50%,303.000000,2022.000000,NaN,NaN,NaN,1.150000e+05,NaN,101570.000000,NaN,100.00000,NaN,NaN
75%,454.500000,2022.000000,NaN,NaN,NaN,1.650000e+05,NaN,150000.000000,NaN,100.00000,NaN,NaN
max,606.000000,2022.000000,NaN,NaN,NaN,3.040000e+07,NaN,600000.000000,NaN,100.00000,NaN,NaN

## drop unnecessary collumns

In [12]:
df = df.drop(columns=['Unnamed: 0'])
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

## clean salary

In [13]:
df['salary_in_usd'] = pd.to_numeric(df['salary_in_usd'], errors='coerce') # Convert to numeric, set errors to NaN

df['salary_in_usd'] = df['salary_in_usd'].fillna(df['salary_in_usd'].median()) # Fill NaN with median salary

## Map experience lvl

In [14]:
exp_map = {
    'EN': 'Entry level',
    'MI': 'Mid level',
    'SE': 'Senior level',
    'EX': 'Executive level'
}

df['experience_level'] = df['experience_level'].map(exp_map)

## handle categorical columns

In [15]:
print(df['employment_type'].unique())
print(df['company_size'].unique())

df['employment_type'] = df['employment_type'].fillna('FT')  # Fill missing employment types with 'FT'
df['company_size'] = df['company_size'].fillna('M')

['FT' 'CT' 'PT' 'FL']
['L' 'S' 'M']

# Save the cleaned dataset

In [16]:
import os 

os.makedirs('../cleaned_data', exist_ok=True)
df.to_csv('../cleaned_data/salaries_cleaned.csv', index=False)